app/Controllers/Hotel.php

DELETE FROM `location`
WHERE `id` IN ('18')
---
    public function delete($id)
    {
        $model = model(LocationInfo::class);
        $model->delete($id);