app/Models/LocationInfo.php

    public function getLocationInfo($city = false)
    {
        if ($city == false) {
            return $this->findAll();
        }

        return $this->where(['city' => $city])->first();
---
SELECT *
FROM `location`
SELECT *
FROM `location`
WHERE `city` = 'Jakarta'
 LIMIT 1